#+TITLE: Predict Bike Availability at Bike Sharing Stations
#+AUTHOR: Damien Garaud <damien.garaud@oslandia.com>, Raphaël Delhome <raphael.delhome@oslandia.com>

In a [[http://oslandia.com/en/2017/11/29/cluster-bike-sharing-stations-around-french-cities/][previous article]], we described the clustering of bike sharing stations in
two French cities, /i.e./ Bordeaux and Lyon. We saw that geospatial clustering
is interesting to understand city organization. Results were especially
impressive for the Lyon data set.

Here we propose to continue the effort about bike sharing system description by
attempting to predict the bike availability rates for each station in Lyon.

* Collecting the data

As in the previous article we can use almost two months and a half of recordings at
every bike sharing stations in Lyon, between 2017/07/08 and 2017/09/26.

By simplifying our data, we can see that we get timestamped bike availability
data at each station.

#+BEGIN_SRC ipython :session openbike_pred :exports none
import sources.prediction as pred
import pandas as pd

raw = pd.read_csv("../data/lyon.csv", parse_dates=["last_update"])
#+END_SRC

#+BEGIN_SRC ipython :session openbike_pred :exports results
lyon = pred.cleanup(raw)
lyon.sample(5)
#+END_SRC

#+RESULTS:
:          station                  ts  stands  bikes bonus
: 5466310     2002 2017-09-05 23:24:54      18      2   Non
: 6245383     5015 2017-09-13 18:32:57       5     14   Non
: 7074115    11003 2017-09-22 02:49:36       2     18   Non
: 5748741     8008 2017-09-08 19:16:41       3     10   Non
: 3372882     6020 2017-08-16 01:29:05       2     13   Non

We preprocess a little bit more these data so as to extract timestamp
features and the probability to find a bike at each period of the day. Here
data is resampled to 10-minute periods, and the amount of available bikes is
averaged regarding records gathered during each period.

#+BEGIN_SRC ipython :session openbike_pred :exports results
lyon = lyon.pipe(pred.time_resampling).pipe(pred.complete_data).pipe(pred.bikes_probability)
lyon.head(5)
#+END_SRC

#+RESULTS:
:    station                  ts  bikes  stands  day  hour  minute  probability
: 0     1001 2017-07-09 00:00:00   15.0     1.0    6     0       0      0.93750
: 1     1001 2017-07-09 00:10:00   15.0     1.0    6     0       0      0.93750
: 2     1001 2017-07-09 00:20:00   14.5     1.5    6     0      10      0.90625
: 3     1001 2017-07-09 00:30:00   14.5     1.5    6     0      20      0.90625
: 4     1001 2017-07-09 00:40:00   11.5     4.5    6     0      30      0.71875

This is the final data set that we will give to the predictive model. To
improve the quality of predictions, other types of data could be integrated to
this framework, /e.g./ weather forecasts (however we let it for a further study).

